# Zone Service Type Property

Source: https://www.revitapidocs.com/2026/d55f087f-6d1a-99d7-07a7-7806729d4f38.htm

---

| Zone Service Type Property |
| --- |

**Note: This API is now obsolete.**

Get or set the Service Type of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
public ServiceType ServiceType { get; set; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>
Public Property ServiceType As ServiceType
	Get
	Set
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
property ServiceType ServiceType {
	ServiceType get ();
	void set (ServiceType value);
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>]
member ServiceType : ServiceType with get, set
```

#### Property Value

ServiceType Remarks This property is used to get or set the Service Type of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace